packages/core-component-repository/src/CoreComponentRepository.php

    public static function initializeCache(): void
    {
        foreach (Addon::all() as $addon) {
---
select * from `addons`