app/Http/Helpers.php

    function uploaded_asset($id)
    {
        try {
            if (!\Illuminate\Support\Facades\Schema::hasTable('uploads')) {
                return static_asset('assets/img/placeholder.jpg');
            }
        } catch (\Throwable $e) {
            return static_asset('assets/img/placeholder.jpg');
        }

        if (($asset = Upload::find($id)) != null) {
---
select * from `uploads` where `uploads`.`id` is null and `uploads`.`deleted_at` is null limit 1

    function addon_is_activated($identifier, $default = null)
    {
        $forceDisabledAddons = [
            'gst_system',
        ];
        if (in_array($identifier, $forceDisabledAddons, true)) {
            return false;
        }

        try {
            if (!\Illuminate\Support\Facades\Schema::hasTable('addons')) {
                return $default === null ? false : (bool) $default;
            }
        } catch (\Throwable $e) {
            return $default === null ? false : (bool) $default;
        }

        $addons = Cache::remember('addons', 86400, function () {
            return Addon::all();
---
select * from `addons`

    function get_session_language()
    {
        try {
            if (!\Illuminate\Support\Facades\Schema::hasTable('languages')) {
                return (object) [
                    'code' => 'en',
                    'name' => 'English',
                    'rtl' => 0,
                ];
            }
        } catch (\Throwable $e) {
            return (object) [
                'code' => 'en',
                'name' => 'English',
                'rtl' => 0,
            ];
        }

        $language_query = Language::query();
        return $language_query->where('code', Session::get('locale', Config::get('app.locale')))->first() ?: (object) [
            'code' => 'en',
            'name' => 'English',
            'rtl' => 0,
        ];
---
select * from `languages` where `code` = 'en' limit 1