app/Http/Controllers/AdminController.php

    public function admin_dashboard(Request $request)
    {
        CoreComponentRepository::initializeCache();
        $root_categories = Category::where('level', 0)->get();

        $data['cached_graph_data'] = Cache::remember('cached_graph_data', 86400, function () use ($root_categories) {
            $num_of_sale_data = null;
            $qty_data = null;
            foreach ($root_categories as $key => $category) {
                $category_ids = \App\Utility\CategoryUtility::children_ids($category->id);
                $category_ids[] = $category->id;

                $products = Product::with('stocks')->whereIn('category_id', $category_ids)->get();
---
select * from `categories` where `level` = 0
select * from `products` where `category_id` in (11, 12, 47, 1)


        $data['root_categories'] = $root_categories;

        $data['total_customers'] = User::where('user_type', 'customer')->where('email_verified_at', '!=', null)->count();
        $data['top_customers'] = User::select('users.id', 'users.name', 'users.avatar_original', DB::raw('SUM(grand_total) as total'))
            ->join('orders', 'orders.user_id', '=', 'users.id')
            ->groupBy('orders.user_id')
            ->where('users.user_type', 'customer')
            ->orderBy('total', 'desc')
            ->limit(6)
            ->get();
---
select count(*) as aggregate from `users` where `user_type` = 'customer' and `email_verified_at` is not null
select `users`.`id`, `users`.`name`, `users`.`avatar_original`, SUM(grand_total) as total from `users` inner join `orders` on `orders`.`user_id` = `users`.`id` where `users`.`user_type` = 'customer' group by `orders`.`user_id` order by `total` desc limit 6

    public function store_top_categories(Request $request)
    {
        $storeTopCategoryQuery = Order::query();
        $storeTopCategoryQuery->select('categories.id', 'categories.name', 'categories.cover_image', DB::raw('SUM(order_details.price + order_details.tax) as total'))
            ->leftJoin('order_details', 'orders.id', '=', 'order_details.order_id')
            ->leftJoin('products', 'order_details.product_id', '=', 'products.id')
            ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
            ->where('orders.delivery_status', '=', 'delivered')
            ->whereRaw('products.added_by = "admin"');
        if ($request->interval_type != 'all') {
            $storeTopCategoryQuery->where('orders.created_at', '>=', DB::raw('DATE_SUB(NOW(), INTERVAL 1 ' . $request->interval_type . ')'));
        }
        $store_top_categories = $storeTopCategoryQuery->groupBy('categories.name')
            ->orderBy('total', 'desc')
            ->limit(5)
            ->get();
---
select `categories`.`id`, `categories`.`name`, `categories`.`cover_image`, SUM(order_details.price + order_details.tax) as total from `orders` left join `order_details` on `orders`.`id` = `order_details`.`order_id` left join `products` on `order_details`.`product_id` = `products`.`id` left join `categories` on `products`.`category_id` = `categories`.`id` where `orders`.`delivery_status` = 'delivered' and products.added_by = "admin" group by `categories`.`name` order by `total` desc limit 5

    public function top_sellers_products_section(Request $request)
    {
        $new_top_sellers_query = Order::query();
        $new_top_sellers_query = Order::select('shops.user_id AS shop_id', 'shops.name AS shop_name', 'shops.logo', DB::raw('SUM(grand_total) AS sale'))
            ->join('shops', 'orders.seller_id', '=', 'shops.user_id')
            ->whereIn("seller_id", function ($query) {
                $query->select('id')
                    ->from('users')
                    ->where('user_type', 'seller');
            })
            ->where('orders.delivery_status', 'delivered')
            ->groupBy('orders.seller_id')
            ->orderBy('sale', 'desc');
        if ($request->interval_type != 'all') {
            $new_top_sellers_query->where('orders.created_at', '>=', DB::raw('DATE_SUB(NOW(), INTERVAL 1 ' . $request->interval_type . ')'));
        }

        $new_top_sellers = $new_top_sellers_query->get();
---
select `shops`.`user_id` as `shop_id`, `shops`.`name` as `shop_name`, `shops`.`logo`, SUM(grand_total) AS sale from `orders` inner join `shops` on `orders`.`seller_id` = `shops`.`user_id` where `seller_id` in (select `id` from `users` where `user_type` = 'seller') and `orders`.`delivery_status` = 'delivered' group by `orders`.`seller_id` order by `sale` desc